app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)

    if @room.save
---
INSERT INTO "rooms" ("title", "code", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Doctor Thunder Room"], ["code", "1234"], ["url", "somezoomlink"], ["created_at", "2020-09-03 14:30:39.535442"], ["updated_at", "2020-09-03 14:30:39.535442"]]

  def update
    if @room.update(room_params)
---
UPDATE "rooms" SET "code" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["code", "AAAA"], ["updated_at", "2020-09-03 18:33:08.792762"], ["id", 3]]