app/controllers/songlists_controller.rb

  def index
    @songlists = Songlist.all
---
SELECT "songlists".* FROM "songlists"

    def set_songlist
      @songlist = Songlist.find(params[:id])
---
SELECT "songlists".* FROM "songlists" WHERE "songlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]